[
  {
    "name": "Alchemist",
    "innate": "Alchemists move through other units and never stop moving."
  },
  {
    "name": "Assassin",
    "innate": "Assassins sneak across the battlefield at the start of combat, placing themselves opposite from where they started.",
    "description": "Deploying multiple Assassins grant them critical strike chance and increased critical strike damage, increasing with more Assassins.",
    "sets": [3, 6]
  },
  {
    "name": "Avatar",
    "description": "An Avatar's element is counted twice for trait bonuses."
  },
  {
    "name": "Beserker",
    "innate": "At the start of combat, Berserkers leap to the nearest enemy.",
    "description": "Deploying multiple Berserkers grants their attacks a chance to deal damage in a cone behind the target. The chance increases with more Berserkers.",
    "sets": [3, 6]
  },
  {
    "name": "Blademaster",
    "description": "Deploying multiple Blademasters grants their attacks a chance to hit extra times, increasing with more Blademasters.",
    "sets": [2, 4, 6]
  },
  {
    "name": "Cloud",
    "description": "Deploying multiple Cloud champions grants your team dodge change. The dodge chance increases if more Cloud champions are deployed.",
    "sets": [2, 3, 4]
  },
  {
    "name": "Crystal",
    "description": "Deploying multiple Crystal champions grants them a maximum amount of damage they can take from a single attack or ability hit.",
    "sets": [2, 4]
  },
  {
    "name": "Desert",
    "description": "Deploying multiple Desert champions reduces the enemy team's armor. The reduction increases if more Desert champions are deployed.",
    "sets": [2, 4]
  },
  {
    "name": "Druid",
    "description": "Deploying two Druids grants all Druids health regeneration.",
    "sets": [2]
  },
  {
    "name": "Eletric",
    "description": "Deploying multiple Electric champions causes them to damage adjacent enemies whenever they critically strike or are critically struck.",
    "sets": [2, 3, 4]
  },
  {
    "name": "Glacial",
    "description": "Deploying multiple Glacial champions grants their attacks a chance to stun their target, increasing with more Glacials.",
    "sets": [2, 4, 6]
  },
  {
    "name": "Inferno",
    "description": "Deploying multiple Inferno champions causes their abilities to temporarily ignite the ground beneath their targets, damaging enemies standing in the fire. Damage increases with more Inferno champions.",
    "sets": [3, 6, 9]
  },
  {
    "name": "Light",
    "description": "Deploying multiple Light champions causes them to, on death, heal other Light champions for a percentage of their max health and grant them attack speed for the remainer of the round (stacking with multiple Light champion deaths). Heal and attack speed increse with more Light champions.",
    "sets": [3, 6, 9]
  },
  {
    "name": "Mage",
    "description": "Deploying multiple Mages grants them a chance after casting an ability to cast it again. This chance increases with more Mages.",
    "sets": [3, 6]
  },
  {
    "name": "Mountain",
    "description": "Deploying multiple Mountain champions grants a massive shield to a random ally at the start of combat.",
    "sets": [2]
  },
  {
    "name": "Mystic",
    "description": "Deploying multiple Mystics grants all allies magic resist, increasing with more Mystics.",
    "sets": [2, 4]
  },
  {
    "name": "Ocean",
    "description": "Deploying multiple Ocean champions periodically grants allies mana. The amount increases with more Ocean champions.",
    "sets": [2, 4, 6]
  },
  {
    "name": "Poison",
    "description": "Deploying mutliple Poison champions causes their damaging attacks and abilities to increase the mana costs of their targets' abilities.",
    "sets": [3]
  },
  {
    "name": "Predator",
    "description": "Deploying multiple Predators causes their attacks and abilities to immediately kill low-health enemies.",
    "sets": [3]
  },
  {
    "name": "Ranger",
    "description": "Deploying multiple Rangers periodically grants them a chance to gain a burst of attack speed, increasing with more Rangers.",
    "sets": [2, 4, 6]
  },
  {
    "name": "Shadow",
    "description": "Deploying multiple Shadow champions causes them to deal increased damage for the first few seconds of combat, as well as for a few seconds when they score a takedown. Deploying more Shadow champions causes all of them to deal increased damage when any of them score a takedown.",
    "sets": [2, 4]
  },
  {
    "name": "Steel",
    "description": "Deploying multiple Steel champions causes them to briefly become immune to damage when they drop below 50% health.",
    "sets": [2, 3, 4]
  },
  {
    "name": "Summoner",
    "description": "Deploying multiple Summoners increases the health and duration of their spawned allies, increasing with more Summoners. Summoners' pets benefit from Element and Class bonuses, but don't count as additional units toward activiating higher levels of those bonuses.",
    "sets": [3, 6]
  },
  {
    "name": "Warden",
    "description": "Deploying multiple Wardens grants them armor, increasing with more Wardens.",
    "sets": [2, 4, 6]
  },
  {
    "name": "Woodland",
    "description": "Deploying multiple Woodland champions causes one of them to randomly create a clone of themselves (including items) at the start of combat.",
    "sets": [3]
  }
]